import type { GETCoursesResponse } from "@/api/courses"

const exampleCourseSearchResults: GETCoursesResponse = [
  {
    id: 745,
    code: "CS.20004",
    department: {
      name: "전산학부",
      id: 9945,
    },
    title: "이산구조",
    type: "전공필수",
    summary:
      "집합이론, 관계, 순열과 조합의 개념과 그 응용 전개함수, 재발관계, 유한 이산구조의 존재와 나열,Propositional and predicate logic 등 알고리즘의 설계와 분석 그리고 컴퓨터 전반에 걸쳐 필요한 추상적인개념을 다룬다.",
    professors: [
      {
        id: 123,
        name: "강성원",
      },
      {
        id: 123,
        name: "김순태",
      },
      {
        id: 123,
        name: "김태환",
      },
      {
        id: 123,
        name: "마틴 지글러",
      },
      {
        id: 123,
        name: "박종철",
      },
      {
        id: 123,
        name: "박진아",
      },
      {
        id: 123,
        name: "신형강",
      },
      {
        id: 123,
        name: "신형강",
      },
      {
        id: 123,
        name: "원광연",
      },
      {
        id: 123,
        name: "이승철",
      },
      {
        id: 123,
        name: "이주영",
      },
      {
        id: 123,
        name: "정진완",
      },
      {
        id: 123,
        name: "최광무",
      },
      {
        id: 123,
        name: "최기선",
      },
      {
        id: 123,
        name: "최성희",
      },
      {
        id: 123,
        name: "황규영",
      },
    ],
    open: true,
  },
  {
    id: 746,
    code: "CS.20006",
    department: {
      name: "전산학부",
      id: 9945,
    },
    type: "전공필수",
    title: "데이타구조",
    summary:
      "추상적 데이타 형의 개념과 배열, 큐, 스텍, 트리, 그래프 등 데이타 구조의 여러 가지 구현방법 및 storage관리기법을 습득한다. 또한 여러 가지 탐색, 정렬 알고리즘을 배운다.",
    professors: [
      {
        id: 123,
        name: "강성원",
      },
      {
        id: 123,
        name: "김기응",
      },
      {
        id: 123,
        name: "김명호",
      },
      {
        id: 123,
        name: "김병형",
      },
      {
        id: 123,
        name: "김태환",
      },
      {
        id: 123,
        name: "류덕산",
      },
      {
        id: 123,
        name: "류덕산",
      },
      {
        id: 123,
        name: "류덕산",
      },
      {
        id: 123,
        name: "문수복",
      },
      {
        id: 123,
        name: "문은영",
      },
      {
        id: 123,
        name: "세게브",
      },
      {
        id: 123,
        name: "손수엘",
      },
      {
        id: 123,
        name: "심규석",
      },
      {
        id: 123,
        name: "염익준",
      },
      {
        id: 123,
        name: "오혜연",
      },
      {
        id: 123,
        name: "윤성의",
      },
      {
        id: 123,
        name: "이광형",
      },
      {
        id: 123,
        name: "이기혁",
      },
      {
        id: 123,
        name: "이윤준",
      },
      {
        id: 123,
        name: "이준상",
      },
      {
        id: 123,
        name: "정지원",
      },
      {
        id: 123,
        name: "정진완",
      },
      {
        id: 123,
        name: "황규영",
      },
    ],
    open: true,
  },
  {
    id: 747,
    code: "CS.30000",
    department: {
      id: 9945,
      name: "전산학부",
    },
    title: "알고리즘 개론",
    type: "전공필수",
    summary:
      "알고리즘의 시간 및 공간 복잡도를 분석하고 효율적인 알고리즘을 설계하는 기본적인 기법을 습득하며 정렬, 탐색, 그래프 순방, 문자열 정합, 동적프로그래밍 및 함수와 배열계산을 통하여 이 기법을 익힌다. NP완전문제와 병렬 알고리즘의 기본 개념을 다룬다. (선수과목 : CS204, CS206)",
    professors: [
      {
        id: 123,
        name: "마틴 지글러",
      },
      {
        id: 123,
        name: "송준화",
      },
      {
        id: 123,
        name: "신성용",
      },
      {
        id: 123,
        name: "에릭 비고다",
      },
      {
        id: 123,
        name: "정지원",
      },
      {
        id: 123,
        name: "최성희",
      },
      {
        id: 123,
        name: "헬무트알트",
      },
    ],
    open: false,
  },
  {
    id: 748,
    code: "CS.30101",
    department: {
      id: 9945,
      name: "전산학부",
    },
    title: "전산기조직",
    type: "전공필수",
    summary:
      "이 교과목의 목적은 기본적인 전자계산기의 구성과 설계에 대한 개념과 기법을 소개하고, 데이타의 표시방법, 레지스터 전송과 마이크로 동작, 전자계산기 소프트웨어를 위시하여 연산장치, 제어장치, 기억장치, 입출력장치 등의 구조와 설계기법을 습득함으로써 전자계산기를 설계할 수 있는 기초적인 능력을 얻는데 있다.(선수과목 : CS211)",
    professors: [
      {
        id: 123,
        name: "김동준",
      },
      {
        id: 123,
        name: "김순태",
      },
      {
        id: 123,
        name: "박종세",
      },
      {
        id: 123,
        name: "윤현수",
      },
      {
        id: 123,
        name: "이흥규",
      },
      {
        id: 123,
        name: "조정완",
      },
      {
        id: 123,
        name: "허재혁",
      },
    ],
    open: false,
  },
  {
    id: 749,
    code: "CS.30200",
    department: {
      id: 9945,
      name: "전산학부",
    },
    title: "프로그래밍언어",
    type: "전공필수",
    summary:
      "이 과목에서는 프로그래밍 언어를 구성하고 있는 원소들의 원리, 이론적 배경과 실제를 익힌다. 또한, 현재널리 쓰이는 언어들의 특징을 파라다임별로 살펴보고 차세대 프로그래밍 언어가 갖추어야 할 요소와 프로그래밍 언어가 소프트웨어 개발에 미치는 영향을 이해하게 한다. (선수과목 : CS206)",
    professors: [
      {
        id: 123,
        name: "류석영",
      },
      {
        id: 123,
        name: "이광근",
      },
      {
        id: 123,
        name: "한동수",
      },
      {
        id: 123,
        name: "한태숙",
      },
    ],
    open: true,
  },
  {
    id: 750,
    code: "CS.30300",
    department: {
      id: 9945,
      name: "전산학부",
    },
    title: "운영체제 및 실험",
    type: "전공필수",
    summary:
      "운영체제는 컴퓨터 시스템에서 가장 중요한 요소 중 하나로, 이 과목에서는 운영 체제의 기본 개념과 여러가지 기능들을 다룬다. 또한, 운영 체제의 몇 가지 기능들을 설계하고 구현하는 실습을 병행한다. (선수 과목 : CS230)",
    professors: [
      {
        id: 123,
        name: "권영진",
      },
      {
        id: 123,
        name: "김길창",
      },
      {
        id: 123,
        name: "김진수",
      },
      {
        id: 123,
        name: "송준화",
      },
      {
        id: 123,
        name: "신인식",
      },
      {
        id: 123,
        name: "양재헌",
      },
      {
        id: 123,
        name: "이준원",
      },
      {
        id: 123,
        name: "이준원",
      },
    ],
    open: false,
  },
]

export default exampleCourseSearchResults
